package datatype;

/**
 * @author yj
 * @date: 2018/12/28
 * @time: 15:08
 * @Description:
 */
public class DataTypeConversion {

    /**
     *
     * @param args
     */
    public static void main(String[] args) {

        byte a = -126;  // 1111 1110  原码    10000 0001 反码   1000 0010 补码
        int b = -3;  //    10000000 00000000 00000000 00000011  原码    0111 1100 反码   0111 1101 补码
               //          11111111 11111111 11111111 11111100  反码
           //              11111111 11111111 11111111 11111101  补码
//a                        00000000 00000000 00000000 10000010
         //求和           100000000 00000000 00000000 01111111  补码
        //0111 1111   反码  0111 1111  原码 0111 1111      127

        byte c = (byte) (a + b);  //-129   10000001
        System.out.println(c);    //类型向下，可能损失精度
    }

}
